In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('grades.csv')
df.head()

,student_id,assignment1_grade,assignment1_submission,assignment2_grade,assignment2_submission,assignment3_grade,assignment3_submission,assignment4_grade,assignment4_submission,assignment5_grade,assignment5_submission,assignment6_grade,assignment6_submission
0,B73F2C11-70F0-E37D-8B10-1D20AFED50B1,92.733946,2015-11-02 06:55:34.282000000,83.030552,2015-11-09 02:22:58.938000000,67.164441,2015-11-12 08:58:33.998000000,53.011553,2015-11-16 01:21:24.663000000,47.710398,2015-11-20 13:24:59.692000000,38.168318,2015-11-22 18:31:15.934000000
1,98A0FAE0-A19A-13D2-4BB5-CFBFD94031D1,86.790821,2015-11-29 14:57:44.429000000,86.290821,2015-12-06 17:41:18.449000000,69.772657,2015-12-10 08:54:55.904000000,55.098125,2015-12-13 17:32:30.941000000,49.588313,2015-12-19 23:26:39.285000000,44.629482,2015-12-21 17:07:24.275000000
2,D0F62040-CEB0-904C-F563-2F8620916C4E,85.512541,2016-01-09 05:36:02.389000000,85.512541,2016-01-09 06:39:44.416000000,68.410033,2016-01-15 20:22:45.882000000,54.728026,2016-01-11 12:41:50.749000000,49.255224,2016-01-11 17:31:12.489000000,44.329701,2016-01-17 16:24:42.765000000
3,FFDF2B2C-F514-EF7F-6538-A6A53518E9DC,86.030665,2016-04-30 06:50:39.801000000,68.824532,2016-04-30 17:20:38.727000000,61.942079,2016-05-12 07:47:16.326000000,49.553663,2016-05-07 16:09:20.485000000,49.553663,2016-05-24 12:51:18.016000000,44.598297,2016-05-26 08:09:12.058000000
4,5ECBEEB6-F1CE-80AE-3164-E45E99473FB4,64.813800,2015-12-13 17:06:10.750000000,51.491040,2015-12-14 12:25:12.056000000,41.932832,2015-12-29 14:25:22.594000000,36.929549,2015-12-28 01:29:55.901000000,33.236594,2015-12-29 14:46:06.628000000,33.236594,2016-01-05 01:06:59.546000000

In [8]:
early = df[df['assignment1_submission']<='2015-12-31']
late = df[df['assignment1_submission']>'2015-12-21']
early.head()

,student_id,assignment1_grade,assignment1_submission,assignment2_grade,assignment2_submission,assignment3_grade,assignment3_submission,assignment4_grade,assignment4_submission,assignment5_grade,assignment5_submission,assignment6_grade,assignment6_submission
0,B73F2C11-70F0-E37D-8B10-1D20AFED50B1,92.733946,2015-11-02 06:55:34.282000000,83.030552,2015-11-09 02:22:58.938000000,67.164441,2015-11-12 08:58:33.998000000,53.011553,2015-11-16 01:21:24.663000000,47.710398,2015-11-20 13:24:59.692000000,38.168318,2015-11-22 18:31:15.934000000
1,98A0FAE0-A19A-13D2-4BB5-CFBFD94031D1,86.790821,2015-11-29 14:57:44.429000000,86.290821,2015-12-06 17:41:18.449000000,69.772657,2015-12-10 08:54:55.904000000,55.098125,2015-12-13 17:32:30.941000000,49.588313,2015-12-19 23:26:39.285000000,44.629482,2015-12-21 17:07:24.275000000
4,5ECBEEB6-F1CE-80AE-3164-E45E99473FB4,64.813800,2015-12-13 17:06:10.750000000,51.491040,2015-12-14 12:25:12.056000000,41.932832,2015-12-29 14:25:22.594000000,36.929549,2015-12-28 01:29:55.901000000,33.236594,2015-12-29 14:46:06.628000000,33.236594,2016-01-05 01:06:59.546000000
5,D09000A0-827B-C0FF-3433-BF8FF286E15B,71.647278,2015-12-28 04:35:32.836000000,64.052550,2016-01-03 21:05:38.392000000,64.752550,2016-01-07 08:55:43.692000000,57.467295,2016-01-11 00:45:28.706000000,57.467295,2016-01-11 00:54:13.579000000,57.467295,2016-01-20 19:54:46.166000000
8,C9D51293-BD58-F113-4167-A7C0BAFCB6E5,66.595568,2015-12-25 02:29:28.415000000,52.916454,2015-12-31 01:42:30.046000000,48.344809,2016-01-05 23:34:02.180000000,47.444809,2016-01-02 07:48:42.517000000,37.955847,2016-01-03 21:27:04.266000000,37.955847,2016-01-19 15:24:31.060000000

In [9]:
late.head()

,student_id,assignment1_grade,assignment1_submission,assignment2_grade,assignment2_submission,assignment3_grade,assignment3_submission,assignment4_grade,assignment4_submission,assignment5_grade,assignment5_submission,assignment6_grade,assignment6_submission
2,D0F62040-CEB0-904C-F563-2F8620916C4E,85.512541,2016-01-09 05:36:02.389000000,85.512541,2016-01-09 06:39:44.416000000,68.410033,2016-01-15 20:22:45.882000000,54.728026,2016-01-11 12:41:50.749000000,49.255224,2016-01-11 17:31:12.489000000,44.329701,2016-01-17 16:24:42.765000000
3,FFDF2B2C-F514-EF7F-6538-A6A53518E9DC,86.030665,2016-04-30 06:50:39.801000000,68.824532,2016-04-30 17:20:38.727000000,61.942079,2016-05-12 07:47:16.326000000,49.553663,2016-05-07 16:09:20.485000000,49.553663,2016-05-24 12:51:18.016000000,44.598297,2016-05-26 08:09:12.058000000
5,D09000A0-827B-C0FF-3433-BF8FF286E15B,71.647278,2015-12-28 04:35:32.836000000,64.052550,2016-01-03 21:05:38.392000000,64.752550,2016-01-07 08:55:43.692000000,57.467295,2016-01-11 00:45:28.706000000,57.467295,2016-01-11 00:54:13.579000000,57.467295,2016-01-20 19:54:46.166000000
6,3217BE3F-E4B0-C3B6-9F64-462456819CE4,87.498744,2016-03-05 11:05:25.408000000,69.998995,2016-03-09 07:29:52.405000000,55.999196,2016-03-16 22:31:24.316000000,50.399276,2016-03-18 07:19:26.032000000,45.359349,2016-03-19 10:35:41.869000000,45.359349,2016-03-23 14:02:00.987000000
7,F1CB5AA1-B3DE-5460-FAFF-BE951FD38B5F,80.576090,2016-01-24 18:24:25.619000000,72.518481,2016-01-27 13:37:12.943000000,65.266633,2016-01-30 14:34:36.581000000,65.266633,2016-02-03 22:08:49.002000000,65.266633,2016-02-16 14:22:23.664000000,65.266633,2016-02-18 08:35:04.796000000

<h3>Hypothesis testing</h3>

<p>Hypothesis is a statement in statistics whch can be either true or false.

It is really difficult to prove this hypothesis to be true and so we for that we use a null hypothesis.

Null Hypothesis is a statement which is completely opposite to the Hypothesis statement. We can prove it wrong to prove our actual statement correct.

For eg. we can say that the Null hypothesis is 30% correct which automatically makes our original hypothesis to be 70% correct.</p>

<h3>Hypothesis statement:</h3> 
<p> The students who join the course on MOOC platform as soon as itis launched perform better than the students who are late joiners</p>

In [10]:
#early and late are two dataframes.
early.mean()

#This shows how smart python is. It automatically skipped the columns which had text or date and time and created average of
#only those columns which had numerical data.

assignment1_grade    74.972741
assignment2_grade    67.252190
assignment3_grade    61.129050
assignment4_grade    54.157620
assignment5_grade    48.634643
assignment6_grade    43.838980
dtype: float64

In [11]:
late.mean()

assignment1_grade    74.101289
assignment2_grade    66.433523
assignment3_grade    60.065054
assignment4_grade    54.057624
assignment5_grade    48.654255
assignment6_grade    43.858301
dtype: float64

<p>Here when we pbserve the mean of grades of both the early as well as the late df we see that both are havinf almost same mean values which can clearly say that we cannot justify our hypothesis based upon this much analusis</p>

<p>Critical value or a threshold value is value which your analysis needs to meet to reject the null hypothesis.
This value is known as a p-value. The value of p-value is 0.05 generally but can be 0.01 or in some cases 0.1 too.

This can by done using scipy librarie's ttest</p>

In [12]:
from scipy import stats

In [13]:
stats.ttest_ind(early['assignment1_grade'],late['assignment1_grade'])

Ttest_indResult(statistic=1.3049967262789917, pvalue=0.19201834192852513)

<h3>Using ttest_ind</h3>

<p>ttest_ind is a function of the scipy library.
    
It compares the mean values of the above two dataframes.

It presents the difference in the mean values using the pvalue.

It our project and hypothesis we are keeping the mean value as 0.05

Here we can see that the pvalue which we got is approximately 0.2 which is much more higher than 0.05

Hence by this pvalue the scipy kit decuced that there is not much difference in mean values of both the dataframes.

We need to reach the threshold to say that the null hypothesis is actually incorrect.</p>

In [14]:
stats.ttest_ind(early['assignment2_grade'],late['assignment2_grade'])

Ttest_indResult(statistic=1.2576808302626612, pvalue=0.20862885607812431)

In [15]:
stats.ttest_ind(early['assignment3_grade'],late['assignment3_grade'])

Ttest_indResult(statistic=1.6866462349483489, pvalue=0.0918006051625147)

In [16]:
stats.ttest_ind(early['assignment4_grade'],late['assignment4_grade'])

Ttest_indResult(statistic=0.16680960585064233, pvalue=0.8675338309110178)

In [18]:
stats.ttest_ind(early['assignment5_grade'],late['assignment5_grade'])

Ttest_indResult(statistic=-0.03442891306672615, pvalue=0.9725379742718006)

In [19]:
stats.ttest_ind(early['assignment6_grade'],late['assignment6_grade'])

Ttest_indResult(statistic=-0.03562574878795354, pvalue=0.9715837222901283)